/* package up error # */
"error %1$d" = "error %1$d";
"error %1$#x" = "error %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Error desconocido: 0";

/* errno error 1 */
"Operation not permitted" = "Operación no permitida";

/* errno error 2 */
"No such file or directory" = "No existe este archivo o directorio";

/* errno error 3 */
"No such process" = "No existe este proceso";

/* errno error 4 */
"Interrupted system call" = "Llamada del sistema interrumpida";

/* errno error 5 */
"Input/output error" = "Error de entrada/salida";

/* errno error 6 */
"Device not configured" = "Dispositivo no configurado";

/* errno error 7 */
"Argument list too long" = "Lista de argumentos demasiado larga";

/* errno error 8 */
"Exec format error" = "Error de formato en el archivo ejecutable";

/* errno error 9 */
"Bad file descriptor" = "Descriptor de archivo erróneo";

/* errno error 10 */
"No child processes" = "No hay procesos secundarios";

/* errno error 11 */
"Resource deadlock avoided" = "Bloqueo del recurso evitado";

/* errno error 12 */
"Cannot allocate memory" = "No se puede asignar memoria";

/* errno error 13 */
"Permission denied" = "Permiso denegado";

/* errno error 14 */
"Bad address" = "Dirección errónea";

/* errno error 15 */
"Block device required" = "Se necesita un dispositivo de bloqueo";

/* errno error 16 */
"Resource busy" = "Recurso ocupado";

/* errno error 17 */
"File exists" = "Archivo existente";

/* errno error 18 */
"Cross-device link" = "Enlace de dispositivo cruzado";

/* errno error 19 */
"Operation not supported by device" = "Operación no admitida por el dispositivo";

/* errno error 20 */
"Not a directory" = "No es un directorio";

/* errno error 21 */
"Is a directory" = "Es un directorio";

/* errno error 22 */
"Invalid argument" = "Argumento no válido";

/* errno error 23 */
"Too many open files in system" = "Demasiados archivos abiertos en el sistema";

/* errno error 24 */
"Too many open files" = "Demasiados archivos abiertos";

/* errno error 25 */
"Inappropriate ioctl for device" = "Ioctl no adecuada para el dispositivo";

/* errno error 26 */
"Text file busy" = "Archivo de texto no disponible";

/* errno error 27 */
"File too large" = "Archivo demasiado grande";

/* errno error 28 */
"No space left on device" = "No queda espacio en el dispositivo";

/* errno error 29 */
"Illegal seek" = "Búsqueda no válida";

/* errno error 30 */
"Read-only file system" = "Sistema de archivos de sólo lectura";

/* errno error 31 */
"Too many links" = "Demasiados enlaces";

/* errno error 32 */
"Broken pipe" = "Canal interrumpido";

/* errno error 33 */
"Numerical argument out of domain" = "Argumento numérico fuera de dominio";

/* errno error 34 */
"Result too large" = "Resultado demasiado grande";

/* errno error 35 */
"Resource temporarily unavailable" = "Recurso no disponible temporalmente";

/* errno error 36 */
"Operation now in progress" = "Operación en curso";

/* errno error 37 */
"Operation already in progress" = "Operación ya en curso";

/* errno error 38 */
"Socket operation on non-socket" = "Operación de conector sobre otro objeto distinto";

/* errno error 39 */
"Destination address required" = "Se requiere una dirección de destino";

/* errno error 40 */
"Message too long" = "Mensaje demasiado largo";

/* errno error 41 */
"Protocol wrong type for socket" = "Tipo de protocolo incorrecto para el conector";

/* errno error 42 */
"Protocol not available" = "Protocolo no disponible";

/* errno error 43 */
"Protocol not supported" = "Protocolo incompatible";

/* errno error 44 */
"Socket type not supported" = "Tipo de conector incompatible";

/* errno error 45 */
"Operation not supported" = "Operación no admitida";

/* errno error 46 */
"Protocol family not supported" = "Familia de protocolos incompatible";

/* errno error 47 */
"Address family not supported by protocol family" = "La familia de direcciones no es compatible con la familia de protocolos";

/* errno error 48 */
"Address already in use" = "Dirección en uso";

/* errno error 49 */
"Can't assign requested address" = "No se puede asignar la dirección solicitada";

/* errno error 50 */
"Network is down" = "Red fuera de servicio";

/* errno error 51 */
"Network is unreachable" = "Imposible acceder a la red";

/* errno error 52 */
"Network dropped connection on reset" = "La red ha cancelado la conexión al reiniciar";

/* errno error 53 */
"Software caused connection abort" = "El software ha causado la anulación de la conexión";

/* errno error 54 */
"Connection reset by peer" = "Conexión restablecida por el interlocutor";

/* errno error 55 */
"No buffer space available" = "No hay espacio disponible en la memoria intermedia";

/* errno error 56 */
"Socket is already connected" = "Conector ya conectado";

/* errno error 57 */
"Socket is not connected" = "Conector no conectado";

/* errno error 58 */
"Can't send after socket shutdown" = "No se puede enviar tras apagar el conector";

/* errno error 59 */
"Too many references: can't splice" = "Demasiadas referencias: imposible unirlas";

/* errno error 60 */
"Operation timed out" = "Tiempo para la operación agotado";

/* errno error 61 */
"Connection refused" = "Conexión rechazada";

/* errno error 62 */
"Too many levels of symbolic links" = "Demasiados niveles de enlaces simbólicos";

/* errno error 63 */
"File name too long" = "Nombre de archivo demasiado largo";

/* errno error 64 */
"Host is down" = "Servidor fuera de servicio";

/* errno error 65 */
"No route to host" = "No hay ruta al servidor";

/* errno error 66 */
"Directory not empty" = "El directorio no está vacío";

/* errno error 67 */
"Too many processes" = "Demasiados procesos";

/* errno error 68 */
"Too many users" = "Demasiados usuarios";

/* errno error 69 */
"Disc quota exceeded" = "Exceso de cuota de disco";

/* errno error 70 */
"Stale NFS file handle" = "Identificador de archivo NFS corrupto";

/* errno error 71 */
"Too many levels of remote in path" = "Demasiados niveles remotos en la ruta";

/* errno error 72 */
"RPC struct is bad" = "Estructura RPC errónea";

/* errno error 73 */
"RPC version wrong" = "Versión RPC incorrecta";

/* errno error 74 */
"RPC prog. not avail" = "Programa RPC no disponible";

/* errno error 75 */
"Program version wrong" = "Versión del programa incorrecta";

/* errno error 76 */
"Bad procedure for program" = "Procedimiento de programa erróneo";

/* errno error 77 */
"No locks available" = "No hay bloqueos disponibles";

/* errno error 78 */
"Function not implemented" = "Función no implementada";

/* errno error 79 */
"Inappropriate file type or format" = "Tipo o formato de archivo no adecuado";

/* errno error 80 */
"Authentication error" = "Error de autenticación";

/* errno error 81 */
"Need authenticator" = "Autenticador necesario";

/* errno error 82 */
"Device power is off" = "La alimentación del dispositivo está apagada";

/* errno error 83 */
"Device error" = "Error del dispositivo";

/* errno error 84 */
"Value too large to be stored in data type" = "Valor demasiado grande para guardarlo en el tipo de datos";

/* errno error 85 */
"Bad executable (or shared library)" = "Archivo ejecutable (o biblioteca compartida) erróneo";

/* errno error 86 */
"Bad CPU type in executable" = "Tipo de CPU erróneo en archivo ejecutable";

/* errno error 87 */
"Shared library version mismatch" = "No coincide la versión de la biblioteca compartida";

/* errno error 88 */
"Malformed Mach-o file" = "Archivo mach-o erróneo";

/* errno error 89 */
"Operation canceled" = "Operación cancelada";

/* errno error 90 */
"Identifier removed" = "Identificador eliminado";

/* errno error 91 */
"No message of desired type" = "Ningún mensaje del tipo deseado";

/* errno error 92 */
"Illegal byte sequence" = "Secuencia ilegal de bytes";

/* errno error 93 */
"Attribute not found" = "Atributo no encontrado";

/* errno error 94 */
"Bad message" = "Mensaje erróneo";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (reservado)";

/* errno error 96 */
"No message available on STREAM" = "Ningún mensaje disponible en la secuencia";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (reservado)";

/* errno error 98 */
"No STREAM resources" = "Ningún recurso de secuencia";

/* errno error 99 */
"Not a STREAM" = "Ninguna secuencia";

/* errno error 100 */
"Protocol error" = "Error del protocolo";

/* errno error 101 */
"STREAM ioctl timeout" = "Tiempo límite de ioctl de la secuencia";

/* errno error 102 */
"Operation not supported on socket" = "Operación no permitida en el conector";

/* errno error 103 */
"Policy not found" = "Política no encontrada";
